<HTML>
<HEAD>
<TITLE>Contact</TITLE>
<meta name="DC.Language" content="fr">
<meta http-equiv="content-language" content="fr">
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
<!-- $Id: author.html 1.12 2017/04/06 23:34:18 wepl Exp wepl $ -->
</HEAD>
<BODY>
<h4><a name="Contact">Contact</a></h4>
<table cellpadding=5>
<tr><td>
e-mail
</td><td>
<a href="mailto:wepl@whdload.de">wepl@whdload.de</a>
<td></tr><tr><td>
Page perso
</td><td>
<a href="http://www.whdload.de/wepl/">http://www.whdload.de/wepl/</a>
<td></tr><tr><td>
Homepage WHDLoad
</td><td>
<a href="http://www.whdload.de/">http://www.whdload.de/</a>
<td></tr><tr><td valign=top>
addresse postale
</td><td>
<address>
Bert Jahn<br>
Samuel-Heinicke-Straße 13<br>
Zwickau<br>
08058<BR>
Allemagne/Deutschland
</address>
</td></tr>
</table>
<h4>A propos de moi</h4>
Quelques informations me concernant et l'historique de WHDLoad.<Br>C'est durant ma scolarité que j'ai eu un premier
contact avec l'&eacute;lectronique. Mon fr&egrave;re, plus ag&eacute que moi de plusieurs ann&eacute;es,
construisait de divers dispositifs qu'il utilisait. J'ai été très impressionn&eacute; et j'ai donc commenc&eacute; &agrave; faire de même.
J'ai construit (ou essay&eacute; de construire) des dispositifs &eacute;lectroniques à partir de quelques LEDs clignotantes
&agrave; des amplificateurs et plus.
Plus tard, les ordinateurs sont devenus plus populaires et j'avais l'acc&egrave;s &agrave; une machine appel&eacute;e KC85.
Je regrettais de ne pas avoir mon propre ordinateur, mais cela n'&eacute;tait pas possible dû à des raisons
financières et le manque de disponibilité en l'Allemagne de l'Est &agrave; l'&eacute;poque.
Donc j'ai commenc&eacute; &agrave; construire un ordinateur &agrave; partir des sch&eacute;mas de construction
imprim&eacute;s dans un fanzine allemand appel&eacute; Funkamateur.
Pendant ce temps, les changements politiques arrivèrent en Allemagne et vint la réunification. Cela a rendu mon
travail obsol&egrave;te et j'ai donc arr&ecirc;t&eacute; par la suite.
J'ai r&eacute;cup&eacute;r&eacute; un vieux CBM 3032, la machine d'un ami et j'ai commenc&eacute; &agrave; programmer dessus.
D'abord en BASIC et plus tard en langage machine (pour des raisons de vitesse). J'ai &eacute;crit un programme de Backgammon sympa et un simulateur rapide de jeu de vie (Cromwell).
Alors, quelques temps plus tard en 1990, j'ai achet&eacute; mon premier Amiga, un A500. Je m'amusais beaucoup
avec mes premiers jeux: Corporation et RoboCop2. J'utilisais mon Amiga surtout pour les jeux.
Plus tard, j'ai acheté une Action Replay III et commencé à m'introduire dans le hardware de l'Amiga et
à modifier quelques programmes pour mon usage personnel. Pour pouvoir utiliser un disque dur, j'ai d'abord vendu mon A500
pour acheter un A2000 qui reçu plus tard une carte GVP G-FORCE 030/25. J'ai toujours cette machine bien qu'elle
ne soit plus utilisée. J'ai  commenc&eacute; &agrave; programmer en l'assembleur et &eacute;crit quelques petits
outils, WRip &eacute;tant probablement le plus connu. A No&euml;l 1994, j'ai cod&eacute; les premiers octets de WHDLoad,
la raison &eacute;tait Cannon Fodder. Il était carr&eacute;ment injouable &agrave; partir de disquettes.
Quelques temps plus t&ocirc;t, j'avais vu une installation pour disque dur du jeu Agony par TLC, et j'avais
&eacute;t&eacute; vraiment impressionn&eacute;. Je me demandais comment cela fonctionnait, le jeu n'utilisait pas
l'OS mais le programme d'installation avait vraiment lu les fichiers &agrave; partir du disque dur.
Apr&egrave;s un regard plus approfondi, j'ai compris son fonctionnement, et j'ai commenc&eacute; &agrave; &eacute;crire quelque chose de semblable pour Cannon Fodder 2. Le code est rest&eacute; inchang&eacute; pendant un long moment sur mon disque dur. J'ai repris le codage en f&eacute;vrier 1996. J'ai alors eu l'id&eacute;e d'un programme qui contiendrait toutes les possibilit&eacute;s techniques pour d&eacute;grader et commuter l'OS, un peu comme une biblioth&egrave;que, et une autre partie de code (le slave, ou esclave) qui devrait contenir
le code sp&eacute;cifique au programme &agrave; installer. C'est alors que WHDLoad est n&eacute;.
J'ai commenc&eacute; &agrave; travailler plus r&eacute;guli&egrave;rement sur WHDLoad. J'ai &eacute;crit les installations pour Gods et Chaos Engine, et en ao&ucirc;t 1996 la premi&egrave;re version publique de WHDLoad (0.43) a &eacute;t&eacute; mise sur aminet.
Je n'en ai pas obtenu beaucoup de r&eacute;ponses, mais j'ai continu&eacute; &agrave; travailler sur WHDLoad.
J'ai mis en oeuvre plus de fonctionnalit&eacute;s et supprim&eacute; des bugs.
Au d&eacute;but de 1997, j'ai cr&eacute;&eacute; la premi&egrave;re page web pour WHDLoad. En avril 1997, les
premi&egrave;res personnes, Harry et Mr Larmer, me contactèrent. Ils &eacute;taient int&eacute;ress&eacute;s pour &eacute;crire des installs utilisant WHDLoad.
Ce fut un &eacute;v&eacute;nement tr&egrave;s heureux pour moi.

<br>Au cours du temps, le projet WHDLoad a grandi et grandi. Plus de fonctions, plus compatible et la plupart
des nouveaux installers programm&eacute;s par des codeurs divers. Cela a pris beaucoup de temps pour &eacute;crire,
tester, et corriger les bugs. Je pense que peu de gens peuvent imaginer &agrave; quel point, tout simplement parce
qu'une grosse partie de WHDLoad n'est simplement pas d&eacute;buggable.
Avec la mise en place d'un enregistrement payant &agrave; partir de la v1.0 de WHDLoad, j'ai essay&eacute; d'obtenir
un peu de reconnaissance et du soutien pour tous les efforts fournis.
De même, les autres auteurs d'installs de WHDLoad sont aussi soutenus par les enregistrements. 

<br>J'esp&egrave;re que vous aussi vous voulez soutenir le d&eacute;veloppement futur de WHDLoad et des
nouveaux installs. Faites en sorte que le r&ecirc;ve qu'un jour il n'y aura plus aucun jeu non install&eacute;
sur disquette devienne r&eacute;alit&eacute;...

<p>2014-11-01: Avec la sortie de la version 18.0 de WHDLoad, voici maintenant une petite rétrospective.
Ce projet a commencé depuis plusieurs années et aujourd'hui, je suis toujours en train de travailler sur WHDLoad, la page web
et les installs. Des contributeurs très actifs continuent à écrire et mettre à jour des installs,
merci beaucoup à eux pour cela! De même, les utilisateurs s'enregistrent toujours bien que
l'Amiga classique est entré dans l'ère de l'informatique rétro. Je suis content de tout ce travail, et que
WHDLoad semble être utile à de nombreuses personnes et peut aider en quelque sorte à se remémorer de bon souvenirs
de notre jeunesse. Je dois avouer que je me demandais parfois si tout le temps passé sur WHDLoad,
au final, en valait le coup. Peut-être d'autres choses ont été abandonnées ou inachevées à cause de cela. 
La vie est un chemin à sens unique, et j'espère que je pourrai prendre les décisions dans un temps
et d'en accepter les regrèts plus tard. Moins de portes restent à ouvrir pour des missions complètement différentes,
néanmoins j'essayerai de les ouvrir et de poursuivre les travaux sur WHDLoad.
</BODY>
</HTML>
