<HTML>
<HEAD>
<TITLE>Dumping</TITLE>
<meta name="DC.Language" content="fr">
<meta http-equiv="content-language" content="fr">
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
<!-- $Id: dump.html 1.7 2014/12/04 23:37:38 wepl Exp wepl $ -->
</HEAD>
<BODY>
<h3>Dumps et fichiers de log WHDLoad</h3>
Principalement &agrave; des fins de debug, WHDLoad est capable de cr&eacute;&eacute;r plusieurs types de fichiers dumps (images m&eacute;moire/registres) et de log (trace).
<h4><a name="memory">Dump m&eacute;moire</a></h4>
Un dump m&eacute;moire est un fichier contenant toute la m&eacute;moire utilis&eacute;e par le programme install&eacute;.
La taille du fichier d&eacute;pend du programme install&eacute; (&eacute;gal &agrave; la valeur de <a href="../autodoc.html#ws_BaseMemSize">ws_BaseMemSize</a> dans la structure du Slave). Un dump m&eacute;moire est cr&eacute;&eacute; si la <a href="opt.html#DebugKey">touche de debug (DebugKey)</a> est press&eacute;e ou si en cas d'erreur le bouton Coredump est cliqu&eacute;.
Le nom du fichier dump cr&eacute;&eacute; est ".whdl_memory". L'emplacement par d&eacute;faut est "PROGDIR:"
mais peut &ecirc;tre modifi&eacute; &agrave; l'aide de l'option <a href="opt.html#CoreDumpPath">CoreDumpPath</a>.
Un fichier existant du m&ecirc;me nom sera &eacute;cras&eacute;. Si le programme install&eacute; utilise de la
m&eacute;moire étendue, celle-ci est sauvegard&eacute;e sous le nom ".whdl_expmem".

<h4><a name="register">Dump des registres</a></h4>
Le dump des registres contient l'&eacute;tat complet du CPU (incluant le MMU), les CIA et les coprocesseurs (Custom chips).
Certains registres Custom et CIA ne peuvent être lus. Ils ne sont contenus dans le fichier de dump que si le mode <a
href="opt.html#Snoop">Snoop</a> est actif. Les informations sont &eacute;crites dans un fichier ASCII avec mise en forme utilisant des s&eacute;quences d'&eacute;chappement (utilisant CSI - Control Sequence Introducer, 155). Pour visualiser le fichier, un programme qui comprend les s&eacute;quences d'&eacute;chappement est recommand&eacute;
(ex: More, MuchMore, Multiview,
...). Le nom du fichier dump cr&eacute;&eacute; est ".whdl_register". L'emplacement par d&eacute;faut est "PROGDIR:" mais peut &ecirc;tre modifi&eacute; &agrave; l'aide de l'option <a href="opt.html#CoreDumpPath">CoreDumpPath</a>. Si un fichier portant le m&ecirc;me nom existe d&eacute;j&agrave;, le dump sera ajout&eacute; &agrave; la suite, sinon un nouveau fichier sera cr&eacute;&eacute;.

<h4><a name="complete">Fichier dump complet</a></h4> Ce fichier dump est un fichier IFF
qui contient toutes les informations des fichiers dump listés ci-dessus afin d'être utilisé par d'autres
applications. La structure du fichier est décrite dans <tt>whddump.i</tt>. Pour le moment, les applications WHDLoadGCI
(graphical coders interface) et <a href="sp.html">SP</a> (save picture) utilisent le fichier dump
complet. Le nom de ce fichier est ".whdl_dump". Le chemin d'accès par défaut est "PROGDIR:" mais
il peut être changé avec l'option <a href="opt.html#CoreDumpPath">CoreDumpPath</a>. Le fichier existant du même nom
sera écrasé.

<h4><a name="FileLog">Log des acc&egrave;s aux fichiers</a></h4>
Tous les acc&egrave;s au disque sont trac&eacute;s si l'option <a
href="opt.html#FileLog">FileLog/S</a> a &eacute;t&eacute; activ&eacute;e. Cette fonctionnalit&eacute; est tr&egrave;s utile pour analyser les op&eacute;rations effectu&eacute;es par le programme install&eacute; sur le disque, dans un souci de debug ou d'optimisation.
Les fonctions resload suivantes cr&eacute;ent une entr&eacute;e dans le fichier de log:
<ul>
<li><a href="../autodoc.html#resload_DeleteFile">resload_DeleteFile</a>
<li><a href="../autodoc.html#resload_DiskLoad">resload_DiskLoad</a>
<li><a href="../autodoc.html#resload_Examine">resload_Examine</a>
<li><a href="../autodoc.html#resload_ExNext">resload_ExNext</a>
<li><a href="../autodoc.html#resload_GetFileSize">resload_GetFileSize</a>
<li><a href="../autodoc.html#resload_GetFileSizeDec">resload_GetFileSizeDec</a>
<li><a href="../autodoc.html#resload_ListFiles">resload_ListFiles</a>
<li><a href="../autodoc.html#resload_LoadFile">resload_LoadFile</a>
<li><a href="../autodoc.html#resload_LoadFileDecrunch">resload_LoadFileDecrunch</a>
<li><a href="../autodoc.html#resload_LoadFileOffset">resload_LoadFileOffset</a>
<li><a href="../autodoc.html#resload_SaveFile">resload_SaveFile</a>
<li><a href="../autodoc.html#resload_SaveFileOffset">resload_SaveFileOffset</a>
</ul>
Chaque acc&egrave;s &agrave; un fichier par les fonctions ci-dessus cr&eacute;e une ligne dans le fichier de log.
Cette ligne affiche la fonction appel&eacute;e, un crc de chaque lecture/écriture de données, les param&egrave;tres,
et le r&eacute;sultat. WHDLoad rassemble les entr&eacute;es log dans un buffer interne
<a href="opt.html#LogBuffer">LogBuffer/K/N</a>. Le buffer est vid&eacute;
en sortie de programme, ou pendant un acc&egrave;s s'il est plein. Les informations sont &eacute;crites dans un fichier
ASCII. Le nom du fichier dump cr&eacute;&eacute; est ".whdl_filelog" (dans les versions précédentes WHDLoad v18.0,
c'était ".whdl_filelog"). L'emplacement par d&eacute;faut est "PROGDIR:"
mais peut &ecirc;tre modifi&eacute; &agrave; l'aide de l'option <a href="opt.html#CoreDumpPath">CoreDumpPath</a>.
Si un fichier portant le m&ecirc;me nom existe d&eacute;j&agrave;, le dump sera ajout&eacute; &agrave; la suite, sinon un nouveau fichier sera cr&eacute;&eacute;.

<h4><a name="CustLog">Log des entrées personnalisables</a></h4> A partir de la version 18.0 de WHDLoad, il est possible
de créer ses propres entrées de log dans le fichier ".whd_log" avec la fonction
<a href="../autodoc.html#resload_Log">resload_Log</a>. Les entrées peuvent être formattées en utilisant un sprintf
comme chaine de charactères et paramètres. Les entrées seront situées dans une mémoire tampon
<a href="opt.html#LogBuffer">LogBuffer/K/N</a> pour eviter d'activer le système d'exploitation. La taille du tampon
devra être augmentée en fonction des entrées. Pour que les entrées de log soient inscrites dans le fichier,
l'option <a href="opt.html#FileLog">FileLog/S</a> doit être activée.
</BODY>
</HTML>
