<HTML>
<HEAD>
<TITLE>Questions fr&eacute;quemment pos&eacute;es (FAQ)</TITLE>
<meta name="DC.Language" content="fr">
<meta http-equiv="content-language" content="fr">
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
<!-- $Id: faq.html 1.9 2015/12/23 22:35:27 wepl Exp wepl $ -->
</HEAD>
<BODY>
<h3>Questions fr&eacute;quemment pos&eacute;es (FAQ)</h3>
<table>
<tr><td valign=top><i>
Question:
</i></td><td><b>
Ok, j'ai r&eacute;cup&eacute;r&eacute; l'installer et il y a des probl&egrave;mes soit avec l'installation ou le d&eacute;marrage. Je suis s&ucirc;r d'avoir tout fait sans erreurs. Alors?
</b></td></tr><tr><td valign=top><i>
R&eacute;ponse:
</i></td><td>
Un tel comportement d&eacute;fecteux peut &ecirc;tre d&ucirc; &agrave; plusieurs raisons:
<ul>
<li>Tooltypes manquants/erron&eacute;s<br>Certains patches ne fonctionnent pas bien ou pas du tout sur certains syst&egrave;mes si certains tooltypes ne sont pas positionn&eacute;s. Consultez la documentation pour savoir quels tooltypes sont disponibles. Des exemples de tooltypes qui peuvent aider &agrave; r&eacute;soudre les probl&egrave;mes: NoCache, NoVBRMove, NoAutoVec, PAL/NTSC, NoMMU.
<li>le fichier readme inclus dans le package d'installation<br>Celui-ci explique souvent les probl&egrave;mes sp&eacute;cifiques, les touches ou les tooltypes qui doivent &ecirc;tre positionn&eacute;s.
<li>mauvaise version de WHDLoad<br>La plupart des installs n&eacute;cessitent la toute derni&egrave;re version de WHDLoad et ne fonctionnent pas sur une version plus ancienne. La r&egrave;gle d'or est d'avoir toujours la derni&egrave;re version install&eacute;e.
<li>votre machine est incompatible<br>En particulier un CPU 68040/060 CPU ou certaines cartes acc&eacute;l&eacute;ratrices ou un autre mat&eacute;riel peut poser des probl&egrave;mes. Essayez de d&eacute;connecter les mat&eacute;riels suspects et relancer le programme install&eacute;.
<li>version non prise en compte<br>Beaucoup de jeux commerciaux ont &eacute;t&eacute; vendus sous diff&eacute;rentes versions (prix normal/r&eacute;&eacute;dition budget/coverdisk, PAL/NTSC...). Bien s&ucirc;r un install ne peut fonctionner que s'il a &eacute;t&eacute; &eacute;crit sp&eacute;cifiquement pour une version particuli&egrave;re d'un jeu. Si vous poss&eacute;dez une version diff&eacute;rente du m&ecirc;me jeu, cela ne fonctionnera pas. Dans ce cas, le seul moyen est de contacter l'auteur de l'install et de lui demander de prendre en compte votre version. Dans la plupart des cas, l'auteur répondra positivement à votre requête et modifiera l'install, ceci en quelques jours.
<li>ancienne version de l'install<br>D&egrave;s qu'un bug est d&eacute;couvert et supprim&eacute;, la nouvelle version de l'install est rendue publique sur le site de WHDLoad. R&eacute;cup&eacute;rez toujours la derni&egrave;re version de l'install. Veuillez noter que la derni&egrave;re version n'est pas toujours celle pr&eacute;sente sur Aminet. Certains installs ne sont m&ecirc;me pas upload&eacute;s sur aminet, et la plupart sont upload&eacute;s avec quelques semaines de retard!
<li>vous avez d&eacute;couvert un bug<br>Bien que tous les installs sont test&eacute;s avant d'&ecirc;tre rendus publics, un bug peut s'&ecirc;tre subrepticement infiltr&eacute;.
Si vous pensez avoir d&eacute;couvert un bug, faites un compte rendu d&eacute;taill&eacute; du probl&egrave;me &agrave; l'auteur de l'install. Pour cela, utilisez le formulaire de soumission de bug. Essayez de d&eacute;crire votre probl&egrave;me aussi pr&eacute;cis&eacute;ment que possible. Si nous n'avons pas connaissance des bugs, nous ne pouvons pas les corriger.
Note: le seul endroit valable pour les probl&egrave;mes ou les rapports de bugs est le formulaire de soumission de bug et non pas
comp.sys.amiga.games ou sur des forums parce que tous les d&eacute;veloppeurs ne les lisent pas forc&eacute;ment.
</ul>
</td></tr>
<tr><td valign=top><i>
Question:
</i></td><td><b>
J'ai un jeu dont je ne trouve pas d'installeur.
</b></td></tr><tr><td valign=top><i>
R&eacute;ponse:
</i></td><td>
Faites une liste de vos requ&ecirc;tes. Vous pouvez aussi inclure des jeux qui ont d&eacute;j&agrave; une installation sur disque dur (fichiers copiables et/ou installation fournie avec le jeu) qui ont des probl&egrave;mes (m&ecirc;me avec des probl&egrave;mes d'affichage ou pas d'option pour quitter), m&ecirc;me s'il n'est pas s&ucirc;r qu'ils soient trait&eacute;s en priorit&eacute;. Souvenez-vous qu'un codeur est capable de traiter environ 25 jeux par an. Indiquez lesquels sont vos favoris avec un syst&egrave;me de priorit&eacute;s (ex: ! et +) et ceux que vous n'aimez pas trop (-), et v&eacute;rifiez vous-m&ecirc;me quels jeux poss&egrave;dent d&eacute;j&agrave; une installation WHDLoad.
</td></tr>
<tr><td valign=top><i>
Question:
</i></td><td><b>
Est-il possible d'utiliser WHDLoad pour installer une d&eacute;mo ou un jeu qui utilise le syst&egrave;me d'exploitation ?
</b></td></tr><tr><td valign=top><i>
R&eacute;ponse:
</i></td><td>
En g&eacute;n&eacute;ral il n'est pas possible pour une d&eacute;mo ou un jeu qui fonctionne sous WHDLoad d'acc&eacute;der &agrave; les
fonctions de l'OS ext&eacute;rieur, &agrave; partir duquel WHDLoad a &eacute;t&eacute; d&eacute;marr&eacute;. En tant qu'auteur du slave, vous devez intercepter
tous les acc&egrave;s au syst&egrave;me. Soit vous d&eacute;sactivez ces acc&egrave;s ou vous les &eacute;mulez. Pour l'&eacute;mulation, les packages KickEmu
sont disponibles. Ils existent dans des versions diff&eacute;rentes (ex: 'Sources/whdload/kick13.s'). Si on utilise l'image
d'un vrai kickstart, on dispose d'un environnement syst&egrave;me complet dans la m&eacute;moire de WHDLoad. Il existe un fichier
ReadMe &agrave; propos de ces fonctionnalit&eacute;s appel&eacute; 'Sources/whdload/kick.readme'.
</td></tr>
<tr><td valign=top><i>
Question:
</i></td><td><b>
Si WHDLoad utilise l'option MMU (l'option <a href="opt.html#NoMMU">NoMMU/S</a> n'est pas positionn&eacute;e
et sur 68030 l'option <a href="opt.html#MMU">MMU/S</a> est positionn&eacute;e il y a des petites erreurs graphiques et
sonores (ex: Beast 2). Un bug?
</b></td></tr><tr><td valign=top><i>
R&eacute;ponse:
</i></td><td>
Cela se produit pendant le chargement. La raison est que WHDLoad doit d&eacute;sactiver les interruptions pendant les
chargements pendant un court moment si la MMU est utilis&eacute;e. Ce comportement ne peut pas &ecirc;tre chang&eacute;.
</td></tr>
<tr><td valign=top><i>
Question:
</i></td><td><b>
Quand j'utilise le tooltype NTSC, WHDLoad provoque un Guru.
</b></td></tr><tr><td valign=top><i>
R&eacute;ponse:
</i></td><td>
Il y a un bug dans MCP 1.30 au niveau du gestionnaire d'&eacute;crans, ce qui fait planter l'appel WHDLoad &agrave; OpenScreenTags.
D&eacute;sactiver le gestionnaire d'&eacute;crans (ScreenManager) pour r&eacute;soudre ce probl&egrave;me.
</td></tr>
<tr><td valign=top><i>
Question:
</i></td><td><b>
Quand je lance des jeux, ils tournent plus vite que la normale (la musique est bizarre) et
le bas de l'image n'est pas affich&eacute;e. J'ai essay&eacute; les tooltypes PAL &amp; NTSC mais sans succ&egrave;s.
</b></td></tr><tr><td valign=top><i>
R&eacute;ponse:
</i></td><td>
Si vous utilisez le pilote de moniteur Voodoo, d&eacute;sactivez "FakeNativeModes" dans les tooltypes
du pilote du moniteur.
</td></tr>
</table>
</BODY>
</HTML>
