/* EaglePlayer - Lade den angegebene Player rein */

parse arg playername

address 'rexx_EP'

options results

addplayer playername

say 'Eagleplayer: ||result
end
